; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_5 ?v6 ?v12)
             (pred_10 ?v1 ?v4)
             (pred_1 ?v6 ?v4)
             (pred_8 ?v3 ?v6 )
	     (pred_2 ?v6)
             (pred_11 ?v5)
             (pred_9 ?v1)
             (pred_12 ?v4)
             (pred_4 ?v6)
             (pred_7 ?v1)
             (pred_6 ?v6)
             (pred_3 ))



(:action op_4
:parameters (?v9 ?v10 ?v8 ?v2)
:precondition (and (pred_11 ?v9) (pred_11 ?v10) (pred_9 ?v8) (pred_12 ?v2)
          (pred_5 ?v9 ?v10) (pred_10 ?v8 ?v2)
                   (pred_1 ?v10 ?v2) (pred_2 ?v9) 
                   (pred_4 ?v10) (pred_7 ?v8))
:effect (and  (pred_6 ?v10) (not (pred_4 ?v10))))


(:action op_1
:parameters (?v9 ?v13)
:precondition (and (pred_11 ?v9) (pred_11 ?v13)
               (pred_2 ?v9) (pred_5 ?v9 ?v13) (pred_6 ?v13))
:effect (and (pred_2 ?v13) (not (pred_2 ?v9))))

(:action op_2
:parameters (?v9 ?v8)
:precondition (and (pred_11 ?v9) (pred_9 ?v8) 
                  (pred_2 ?v9) (pred_8 ?v8 ?v9) (pred_3 ))
:effect (and (pred_7 ?v8)
   (not (pred_8 ?v8 ?v9)) (not (pred_3 ))))


(:action op_3
:parameters (?v9 ?v7 ?v11)
:precondition (and (pred_11 ?v9) (pred_9 ?v7) (pred_9 ?v11)
                  (pred_2 ?v9) (pred_7 ?v11) (pred_8 ?v7 ?v9))
:effect (and (pred_7 ?v7) (pred_8 ?v11 ?v9)
        (not (pred_7 ?v11)) (not (pred_8 ?v7 ?v9))))

(:action op_5
:parameters (?v9 ?v8)
:precondition (and (pred_11 ?v9) (pred_9 ?v8) 
                  (pred_2 ?v9) (pred_7 ?v8))
:effect (and (pred_3 ) (pred_8 ?v8 ?v9) (not (pred_7 ?v8)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_26 obj_23 obj_29 obj_09 obj_31 obj_18 obj_28 obj_25 obj_06 obj_20 obj_15 obj_03 obj_04 obj_19 obj_24 obj_12 obj_11 obj_14 obj_16 obj_05 obj_21 obj_01 obj_30 obj_27 obj_07
    obj_08 obj_10 obj_17
    obj_22 obj_02 obj_13
    )

    (:init
       (pred_3)

       (pred_11 obj_26)
       (pred_11 obj_23)
       (pred_11 obj_29)
       (pred_11 obj_09)
       (pred_11 obj_31)
       (pred_11 obj_18)
       (pred_11 obj_28)
       (pred_11 obj_25)
       (pred_11 obj_06)
       (pred_11 obj_20)
       (pred_11 obj_15)
       (pred_11 obj_03)
       (pred_11 obj_04)
       (pred_11 obj_19)
       (pred_11 obj_24)
       (pred_11 obj_12)
       (pred_11 obj_11)
       (pred_11 obj_14)
       (pred_11 obj_16)
       (pred_11 obj_05)
       (pred_11 obj_21)
       (pred_11 obj_01)
       (pred_11 obj_30)
       (pred_11 obj_27)
       (pred_11 obj_07)
       (pred_12 obj_08)
       (pred_12 obj_10)
       (pred_12 obj_17)
       (pred_9 obj_22)
       (pred_9 obj_02)
       (pred_9 obj_13)

       (pred_5 obj_26 obj_18)
       (pred_5 obj_26 obj_23)
       (pred_5 obj_23 obj_28)
       (pred_5 obj_23 obj_29)
       (pred_5 obj_23 obj_26)
       (pred_5 obj_29 obj_25)
       (pred_5 obj_29 obj_09)
       (pred_5 obj_29 obj_23)
       (pred_5 obj_09 obj_06)
       (pred_5 obj_09 obj_31)
       (pred_5 obj_09 obj_29)
       (pred_5 obj_31 obj_20)
       (pred_5 obj_31 obj_09)
       (pred_5 obj_18 obj_15)
       (pred_5 obj_18 obj_28)
       (pred_5 obj_18 obj_26)
       (pred_5 obj_28 obj_03)
       (pred_5 obj_28 obj_25)
       (pred_5 obj_28 obj_23)
       (pred_5 obj_28 obj_18)
       (pred_5 obj_25 obj_04)
       (pred_5 obj_25 obj_06)
       (pred_5 obj_25 obj_29)
       (pred_5 obj_25 obj_28)
       (pred_5 obj_06 obj_19)
       (pred_5 obj_06 obj_20)
       (pred_5 obj_06 obj_09)
       (pred_5 obj_06 obj_25)
       (pred_5 obj_20 obj_24)
       (pred_5 obj_20 obj_31)
       (pred_5 obj_20 obj_06)
       (pred_5 obj_15 obj_12)
       (pred_5 obj_15 obj_03)
       (pred_5 obj_15 obj_18)
       (pred_5 obj_03 obj_11)
       (pred_5 obj_03 obj_04)
       (pred_5 obj_03 obj_28)
       (pred_5 obj_03 obj_15)
       (pred_5 obj_04 obj_14)
       (pred_5 obj_04 obj_19)
       (pred_5 obj_04 obj_25)
       (pred_5 obj_04 obj_03)
       (pred_5 obj_19 obj_16)
       (pred_5 obj_19 obj_24)
       (pred_5 obj_19 obj_06)
       (pred_5 obj_19 obj_04)
       (pred_5 obj_24 obj_05)
       (pred_5 obj_24 obj_20)
       (pred_5 obj_24 obj_19)
       (pred_5 obj_12 obj_21)
       (pred_5 obj_12 obj_11)
       (pred_5 obj_12 obj_15)
       (pred_5 obj_11 obj_01)
       (pred_5 obj_11 obj_14)
       (pred_5 obj_11 obj_03)
       (pred_5 obj_11 obj_12)
       (pred_5 obj_14 obj_30)
       (pred_5 obj_14 obj_16)
       (pred_5 obj_14 obj_04)
       (pred_5 obj_14 obj_11)
       (pred_5 obj_16 obj_27)
       (pred_5 obj_16 obj_05)
       (pred_5 obj_16 obj_19)
       (pred_5 obj_16 obj_14)
       (pred_5 obj_05 obj_07)
       (pred_5 obj_05 obj_24)
       (pred_5 obj_05 obj_16)
       (pred_5 obj_21 obj_01)
       (pred_5 obj_21 obj_12)
       (pred_5 obj_01 obj_30)
       (pred_5 obj_01 obj_11)
       (pred_5 obj_01 obj_21)
       (pred_5 obj_30 obj_27)
       (pred_5 obj_30 obj_14)
       (pred_5 obj_30 obj_01)
       (pred_5 obj_27 obj_07)
       (pred_5 obj_27 obj_16)
       (pred_5 obj_27 obj_30)
       (pred_5 obj_07 obj_05)
       (pred_5 obj_07 obj_27)
       (pred_4 obj_27)
       (pred_4 obj_15)
       (pred_4 obj_19)
       (pred_1  obj_27 obj_08)
       (pred_1  obj_15 obj_10)
       (pred_1  obj_19 obj_17)
       (pred_6 obj_26)
       (pred_6 obj_23)
       (pred_6 obj_29)
       (pred_6 obj_09)
       (pred_6 obj_31)
       (pred_6 obj_18)
       (pred_6 obj_28)
       (pred_6 obj_25)
       (pred_6 obj_06)
       (pred_6 obj_20)
       (pred_6 obj_03)
       (pred_6 obj_04)
       (pred_6 obj_24)
       (pred_6 obj_12)
       (pred_6 obj_11)
       (pred_6 obj_14)
       (pred_6 obj_16)
       (pred_6 obj_05)
       (pred_6 obj_21)
       (pred_6 obj_01)
       (pred_6 obj_30)
       (pred_6 obj_07)

       (pred_10  obj_22 obj_08)
       (pred_10  obj_02 obj_10)
       (pred_10  obj_13 obj_17)
       (pred_8 obj_22 obj_31)
       (pred_8 obj_02 obj_11)
       (pred_8 obj_13 obj_07)
       (pred_2 obj_14)
    )

    (:goal (and
       (pred_8 obj_22 obj_30)
       (pred_8 obj_02 obj_31)
    ))
(:constraints
  (always (not (pred_2 obj_04)))
)
)

; plan
1. (op_1 obj_14 obj_11)
   deleted: (pred_2 obj_14)
   added: (pred_2 obj_11)
   goals met: 0 of 2
2. (op_2 obj_11 obj_02)
   deleted: (pred_8 obj_02 obj_11) (pred_3)
   added: (pred_7 obj_02)
   goals met: 0 of 2
3. (op_1 obj_11 obj_14)
   deleted: (pred_2 obj_11)
   added: (pred_2 obj_14)
   goals met: 0 of 2
4. (op_1 obj_14 obj_16)
   deleted: (pred_2 obj_14)
   added: (pred_2 obj_16)
   goals met: 0 of 2
5. (op_1 obj_16 obj_05)
   deleted: (pred_2 obj_16)
   added: (pred_2 obj_05)
   goals met: 0 of 2
6. (op_1 obj_05 obj_24)
   deleted: (pred_2 obj_05)
   added: (pred_2 obj_24)
   goals met: 0 of 2
7. (op_1 obj_24 obj_20)
   deleted: (pred_2 obj_24)
   added: (pred_2 obj_20)
   goals met: 0 of 2
8. (op_1 obj_20 obj_31)
   deleted: (pred_2 obj_20)
   added: (pred_2 obj_31)
   goals met: 0 of 2
9. (op_3 obj_31 obj_22 obj_02)
   deleted: (pred_7 obj_02) (pred_8 obj_22 obj_31)
   added: (pred_7 obj_22) (pred_8 obj_02 obj_31)
   goals met: 1 of 2
10. (op_1 obj_31 obj_09)
   deleted: (pred_2 obj_31)
   added: (pred_2 obj_09)
   goals met: 1 of 2
11. (op_1 obj_09 obj_29)
   deleted: (pred_2 obj_09)
   added: (pred_2 obj_29)
   goals met: 1 of 2
12. (op_1 obj_29 obj_25)
   deleted: (pred_2 obj_29)
   added: (pred_2 obj_25)
   goals met: 1 of 2
13. (op_1 obj_25 obj_28)
   deleted: (pred_2 obj_25)
   added: (pred_2 obj_28)
   goals met: 1 of 2
14. (op_1 obj_28 obj_03)
   deleted: (pred_2 obj_28)
   added: (pred_2 obj_03)
   goals met: 1 of 2
15. (op_1 obj_03 obj_11)
   deleted: (pred_2 obj_03)
   added: (pred_2 obj_11)
   goals met: 1 of 2
16. (op_1 obj_11 obj_14)
   deleted: (pred_2 obj_11)
   added: (pred_2 obj_14)
   goals met: 1 of 2
17. (op_1 obj_14 obj_30)
   deleted: (pred_2 obj_14)
   added: (pred_2 obj_30)
   goals met: 1 of 2
18. (op_5 obj_30 obj_22)
   deleted: (pred_7 obj_22)
   added: (pred_3) (pred_8 obj_22 obj_30)
   goals met: 2 of 2
